; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	thermograph3 - mode
	spectrograph4 - mode
	infrared1 - mode
	thermograph2 - mode
	thermograph0 - mode
	groundstation2 - direction
	groundstation4 - direction
	groundstation3 - direction
	groundstation1 - direction
	star0 - direction
	star5 - direction
	planet6 - direction
	star7 - direction
	planet8 - direction
	star9 - direction
	planet10 - direction
	planet11 - direction
	star12 - direction
	planet13 - direction
	star14 - direction
	planet15 - direction
	planet16 - direction
	phenomenon17 - direction
	phenomenon18 - direction
	phenomenon19 - direction
	planet20 - direction
	phenomenon21 - direction
	star22 - direction
	star23 - direction
	star24 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 star14)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 groundstation4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 groundstation1)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 groundstation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 planet15)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 star0)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 star0)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 groundstation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet15)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 groundstation4)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph2)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 groundstation1)
	(supports instrument9 spectrograph4)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 groundstation3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 star5)
	(supports instrument10 thermograph2)
	(supports instrument10 thermograph0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 groundstation1)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 phenomenon17)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 star0)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 star5)
)
(:goal (and
	(pointing satellite3 star9)
	(have_image star5 thermograph2)
	(have_image planet6 thermograph2)
	(have_image star7 spectrograph4)
	(have_image planet8 thermograph2)
	(have_image star9 thermograph0)
	(have_image planet10 infrared1)
	(have_image planet11 infrared1)
	(have_image star12 infrared1)
	(have_image planet13 thermograph0)
	(have_image star14 infrared1)
	(have_image planet15 infrared1)
	(have_image planet16 thermograph2)
	(have_image phenomenon17 thermograph3)
	(have_image phenomenon18 spectrograph4)
	(have_image phenomenon19 thermograph0)
	(have_image planet20 thermograph0)
	(have_image phenomenon21 thermograph2)
	(have_image star22 thermograph0)
	(have_image star23 thermograph0)
	(have_image star24 thermograph3)
))

)

; plan
1. (switch_on instrument11 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument11)
   goals met: 0 of 21
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 21
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 21
4. (turn_to satellite5 phenomenon19 star5)
   deleted: (pointing satellite5 star5)
   added: (pointing satellite5 phenomenon19)
   goals met: 0 of 21
5. (turn_to satellite3 groundstation1 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 21
6. (calibrate satellite3 instrument8 groundstation1)
   added: (calibrated instrument8)
   goals met: 0 of 21
7. (turn_to satellite3 phenomenon18 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon18)
   goals met: 0 of 21
8. (take_image satellite3 phenomenon18 instrument8 spectrograph4)
   added: (have_image phenomenon18 spectrograph4)
   goals met: 1 of 21
9. (turn_to satellite3 phenomenon21 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 phenomenon21)
   goals met: 1 of 21
10. (take_image satellite3 phenomenon21 instrument8 thermograph2)
   added: (have_image phenomenon21 thermograph2)
   goals met: 2 of 21
11. (turn_to satellite3 planet10 phenomenon21)
   deleted: (pointing satellite3 phenomenon21)
   added: (pointing satellite3 planet10)
   goals met: 2 of 21
12. (take_image satellite3 planet10 instrument8 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 3 of 21
13. (turn_to satellite3 planet11 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet11)
   goals met: 3 of 21
14. (take_image satellite3 planet11 instrument8 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 4 of 21
15. (turn_to satellite3 planet15 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet15)
   goals met: 4 of 21
16. (take_image satellite3 planet15 instrument8 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 5 of 21
17. (turn_to satellite3 planet16 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet16)
   goals met: 5 of 21
18. (take_image satellite3 planet16 instrument8 thermograph2)
   added: (have_image planet16 thermograph2)
   goals met: 6 of 21
19. (turn_to satellite3 planet6 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 planet6)
   goals met: 6 of 21
20. (take_image satellite3 planet6 instrument8 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 7 of 21
21. (turn_to satellite3 planet8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet8)
   goals met: 7 of 21
22. (take_image satellite3 planet8 instrument8 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 8 of 21
23. (turn_to satellite3 star12 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star12)
   goals met: 8 of 21
24. (take_image satellite3 star12 instrument8 infrared1)
   added: (have_image star12 infrared1)
   goals met: 9 of 21
25. (turn_to satellite3 star14 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star14)
   goals met: 9 of 21
26. (take_image satellite3 star14 instrument8 infrared1)
   added: (have_image star14 infrared1)
   goals met: 10 of 21
27. (turn_to satellite3 star5 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star5)
   goals met: 10 of 21
28. (take_image satellite3 star5 instrument8 thermograph2)
   added: (have_image star5 thermograph2)
   goals met: 11 of 21
29. (turn_to satellite3 star7 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star7)
   goals met: 11 of 21
30. (take_image satellite3 star7 instrument8 spectrograph4)
   added: (have_image star7 spectrograph4)
   goals met: 12 of 21
31. (turn_to satellite3 star9 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star9)
   goals met: 13 of 21
32. (turn_to satellite1 groundstation4 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation4)
   goals met: 13 of 21
33. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 13 of 21
34. (turn_to satellite1 phenomenon17 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon17)
   goals met: 13 of 21
35. (take_image satellite1 phenomenon17 instrument1 thermograph3)
   added: (have_image phenomenon17 thermograph3)
   goals met: 14 of 21
36. (turn_to satellite1 star24 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star24)
   goals met: 14 of 21
37. (take_image satellite1 star24 instrument1 thermograph3)
   added: (have_image star24 thermograph3)
   goals met: 15 of 21
38. (turn_to satellite5 star0 phenomenon19)
   deleted: (pointing satellite5 phenomenon19)
   added: (pointing satellite5 star0)
   goals met: 15 of 21
39. (calibrate satellite5 instrument11 star0)
   added: (calibrated instrument11)
   goals met: 15 of 21
40. (turn_to satellite5 phenomenon19 star0)
   deleted: (pointing satellite5 star0)
   added: (pointing satellite5 phenomenon19)
   goals met: 15 of 21
41. (take_image satellite5 phenomenon19 instrument11 thermograph0)
   added: (have_image phenomenon19 thermograph0)
   goals met: 16 of 21
42. (turn_to satellite5 planet13 phenomenon19)
   deleted: (pointing satellite5 phenomenon19)
   added: (pointing satellite5 planet13)
   goals met: 16 of 21
43. (take_image satellite5 planet13 instrument11 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 17 of 21
44. (turn_to satellite5 planet20 planet13)
   deleted: (pointing satellite5 planet13)
   added: (pointing satellite5 planet20)
   goals met: 17 of 21
45. (take_image satellite5 planet20 instrument11 thermograph0)
   added: (have_image planet20 thermograph0)
   goals met: 18 of 21
46. (turn_to satellite5 star22 planet20)
   deleted: (pointing satellite5 planet20)
   added: (pointing satellite5 star22)
   goals met: 18 of 21
47. (take_image satellite5 star22 instrument11 thermograph0)
   added: (have_image star22 thermograph0)
   goals met: 19 of 21
48. (turn_to satellite5 star23 star22)
   deleted: (pointing satellite5 star22)
   added: (pointing satellite5 star23)
   goals met: 19 of 21
49. (take_image satellite5 star23 instrument11 thermograph0)
   added: (have_image star23 thermograph0)
   goals met: 20 of 21
50. (turn_to satellite5 star9 star23)
   deleted: (pointing satellite5 star23)
   added: (pointing satellite5 star9)
   goals met: 20 of 21
51. (take_image satellite5 star9 instrument11 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 21 of 21
